bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G474xx.svd
            <register>
               <name>TIMBDIER</name>
               <displayName>TIMBDIER</displayName>
               <description>TIMxDIER</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DLYPRTDE</name>
                     <description>DLYPRTDE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTDE</name>
                     <description>RSTDE</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx2DE</name>
                     <description>RSTx2DE</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETx2DE</name>
                     <description>SETx2DE</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx1DE</name>
                     <description>RSTx1DE</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET1xDE</name>
                     <description>SET1xDE</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT2DE</name>
                     <description>CPT2DE</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT1DE</name>
                     <description>CPT1DE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDDE</name>
                     <description>UPDDE</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REPDE</name>
                     <description>REPDE</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP4DE</name>
                     <description>CMP4DE</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP3DE</name>
                     <description>CMP3DE</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP2DE</name>
                     <description>CMP2DE</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1DE</name>
                     <description>CMP1DE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLYPRTIE</name>
                     <description>DLYPRTIE</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTIE</name>
                     <description>RSTIE</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx2IE</name>
                     <description>RSTx2IE</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETx2IE</name>
                     <description>SETx2IE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx1IE</name>
                     <description>RSTx1IE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET1xIE</name>
                     <description>SET1xIE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT2IE</name>
                     <description>CPT2IE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT1IE</name>
                     <description>CPT1IE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDIE</name>
                     <description>UPDIE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REPIE</name>
                     <description>REPIE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP4IE</name>
                     <description>CMP4IE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP3IE</name>
                     <description>CMP3IE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP2IE</name>
                     <description>CMP2IE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1IE</name>
                     <description>CMP1IE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNTR</name>
               <displayName>CNTR</displayName>
               <description>Timerx Counter Register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNTx</name>
                     <description>Timerx Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBR</name>
               <displayName>PERBR</displayName>
               <description>Timerx Period Register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>PERx</name>
                     <description>Timerx Period value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REPBR</name>
               <displayName>REPBR</displayName>
               <description>Timerx Repetition Register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REPx</name>
                     <description>Timerx Repetition counter               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMP1BR</name>
               <displayName>CMP1BR</displayName>
               <description>Timerx Compare 1 Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMP1x</name>
                     <description>Timerx Compare 1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMP1CBR</name>
               <displayName>CMP1CBR</displayName>
               <description>Timerx Compare 1 Compound           Register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REPx</name>
                     <description>Timerx Repetition value (aliased from               HRTIM_REPx register)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CMP1x</name>
                     <description>Timerx Compare 1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMP2BR</name>
               <displayName>CMP2BR</displayName>
               <description>Timerx Compare 2 Register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMP2x</name>
                     <description>Timerx Compare 2 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMP3BR</name>
               <displayName>CMP3BR</displayName>
               <description>Timerx Compare 3 Register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMP3x</name>
                     <description>Timerx Compare 3 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMP4BR</name>
               <displayName>CMP4BR</displayName>
               <description>Timerx Compare 4 Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMP4x</name>
                     <description>Timerx Compare 4 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPT1BR</name>
               <displayName>CPT1BR</displayName>
               <description>Timerx Capture 1 Register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CPT1x</name>
                     <description>Timerx Capture 1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Timerx Capture 1 Direction               status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPT2BR</name>
               <displayName>CPT2BR</displayName>
               <description>Timerx Capture 2 Register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CPT2x</name>
                     <description>Timerx Capture 2 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Timerx Capture 1 Direction               status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTBR</name>
               <displayName>DTBR</displayName>
               <description>Timerx Deadtime Register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTFLKx</name>
                     <description>Deadtime Falling Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTFSLKx</name>
                     <description>Deadtime Falling Sign Lock</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDTFx</name>
                     <description>Sign Deadtime Falling               value</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTFx</name>
                     <description>Deadtime Falling value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DTRLKx</name>
                     <description>Deadtime Rising Lock</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTRSLKx</name>
                     <description>Deadtime Rising Sign Lock</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTPRSC</name>
                     <description>Deadtime Prescaler</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SDTRx</name>
                     <description>Sign Deadtime Rising value</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTRx</name>
                     <description>Deadtime Rising value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
