bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G474xx.svd
            <register>
               <name>ODISR</name>
               <displayName>ODISR</displayName>
               <description>ODISR</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TF2ODIS</name>
                     <description>TF2ODIS</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF1ODIS</name>
                     <description>TF1ODIS</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TE2ODIS</name>
                     <description>TE2ODIS</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TE1ODIS</name>
                     <description>TE1ODIS</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TD2ODIS</name>
                     <description>TD2ODIS</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TD1ODIS</name>
                     <description>TD1ODIS</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2ODIS</name>
                     <description>TC2ODIS</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1ODIS</name>
                     <description>TC1ODIS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TB2ODIS</name>
                     <description>TB2ODIS</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TB1ODIS</name>
                     <description>TB1ODIS</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TA2ODIS</name>
                     <description>TA2ODIS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TA1ODIS</name>
                     <description>TA1ODIS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ODSR</name>
               <displayName>ODSR</displayName>
               <description>Output Disable Status Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TF2ODS</name>
                     <description>TF2ODS</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF1ODS</name>
                     <description>TF1ODS</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TE2ODS</name>
                     <description>Timer E Output 2 disable               status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TE1ODS</name>
                     <description>Timer E Output 1 disable               status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TD2ODS</name>
                     <description>Timer D Output 2 disable               status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TD1ODS</name>
                     <description>Timer D Output 1 disable               status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2ODS</name>
                     <description>Timer C Output 2 disable               status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1ODS</name>
                     <description>Timer C Output 1 disable               status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TB2ODS</name>
                     <description>Timer B Output 2 disable               status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TB1ODS</name>
                     <description>Timer B Output 1 disable               status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TA2ODS</name>
                     <description>Timer A Output 2 disable               status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TA1ODS</name>
                     <description>Timer A Output 1 disable               status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMCR</name>
               <displayName>BMCR</displayName>
               <description>Burst Mode Control Register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BMSTAT</name>
                     <description>Burst Mode Status</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFBM</name>
                     <description>Timer f Burst Mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEBM</name>
                     <description>Timer E Burst Mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDBM</name>
                     <description>Timer D Burst Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCBM</name>
                     <description>Timer C Burst Mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBBM</name>
                     <description>Timer B Burst Mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TABM</name>
                     <description>Timer A Burst Mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTBM</name>
                     <description>Master Timer Burst Mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BMPREN</name>
                     <description>Burst Mode Preload Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BMPRSC</name>
                     <description>Burst Mode Prescaler</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BMCLK</name>
                     <description>Burst Mode Clock source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BMOM</name>
                     <description>Burst Mode operating mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BME</name>
                     <description>Burst Mode enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMTRG</name>
               <displayName>BMTRG</displayName>
               <description>BMTRG</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OCHPEV</name>
                     <description>OCHPEV</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEV8</name>
                     <description>EEV8</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEV7</name>
                     <description>EEV7</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDEEV8</name>
                     <description>TDEEV8</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDEEV7</name>
                     <description>TDEEV7</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TECMP2</name>
                     <description>TECMP2</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TECMP1</name>
                     <description>TECMP1</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEREP</name>
                     <description>TEREP</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TERST</name>
                     <description>TERST</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDCMP2</name>
                     <description>TDCMP2</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDCMP1</name>
                     <description>TDCMP1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDREP</name>
                     <description>TDREP</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDRST</name>
                     <description>TDRST</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCCMP2</name>
                     <description>TCCMP2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCCMP1</name>
                     <description>TCCMP1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCREP</name>
                     <description>TCREP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCRST</name>
                     <description>TCRST</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBCMP2</name>
                     <description>TBCMP2</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBCMP1</name>
                     <description>TBCMP1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBREP</name>
                     <description>TBREP</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBRST</name>
                     <description>TBRST</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACMP2</name>
                     <description>TACMP2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACMP1</name>
                     <description>TACMP1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAREP</name>
                     <description>TAREP</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TARST</name>
                     <description>TARST</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP4</name>
                     <description>MSTCMP4</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP3</name>
                     <description>MSTCMP3</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP2</name>
                     <description>MSTCMP2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP1</name>
                     <description>MSTCMP1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTREP</name>
                     <description>MSTREP</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTRST</name>
                     <description>MSTRST</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SW</name>
                     <description>SW</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMCMPR</name>
               <displayName>BMCMPR</displayName>
               <description>BMCMPR</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BMCMP</name>
                     <description>BMCMP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMPER</name>
               <displayName>BMPER</displayName>
               <description>Burst Mode Period Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BMPER</name>
                     <description>Burst mode Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
