bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G474xx.svd
            <register>
               <name>BDTAUPR</name>
               <displayName>BDTAUPR</displayName>
               <description>Burst DMA Timerx update           Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMxEEFR3</name>
                     <description>TIMxEEFR3</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCR2</name>
                     <description>TIMxCR2</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxFLTR</name>
                     <description>HRTIM_FLTxR register update               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxOUTR</name>
                     <description>HRTIM_OUTxR register update               enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCHPR</name>
                     <description>HRTIM_CHPxR register update               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRSTR</name>
                     <description>HRTIM_RSTxR register update               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxEEFR2</name>
                     <description>HRTIM_EEFxR2 register update               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxEEFR1</name>
                     <description>HRTIM_EEFxR1 register update               enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRST2R</name>
                     <description>HRTIM_RST2xR register update               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxSET2R</name>
                     <description>HRTIM_SET2xR register update               enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRST1R</name>
                     <description>HRTIM_RST1xR register update               enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxSET1R</name>
                     <description>HRTIM_SET1xR register update               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMx_DTxR</name>
                     <description>HRTIM_DTxR register update               enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP4</name>
                     <description>HRTIM_CMP4xR register update               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP3</name>
                     <description>HRTIM_CMP3xR register update               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP2</name>
                     <description>HRTIM_CMP2xR register update               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP1</name>
                     <description>HRTIM_CMP1xR register update               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxREP</name>
                     <description>HRTIM_REPxR register update               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxPER</name>
                     <description>HRTIM_PERxR register update               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCNT</name>
                     <description>HRTIM_CNTxR register update               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxDIER</name>
                     <description>HRTIM_TIMxDIER register update               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxICR</name>
                     <description>HRTIM_TIMxICR register update               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCR</name>
                     <description>HRTIM_TIMxCR register update               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTBUPR</name>
               <displayName>BDTBUPR</displayName>
               <description>Burst DMA Timerx update           Register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMxEEFR3</name>
                     <description>TIMxEEFR3</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCR2</name>
                     <description>TIMxCR2</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxFLTR</name>
                     <description>HRTIM_FLTxR register update               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxOUTR</name>
                     <description>HRTIM_OUTxR register update               enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCHPR</name>
                     <description>HRTIM_CHPxR register update               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRSTR</name>
                     <description>HRTIM_RSTxR register update               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxEEFR2</name>
                     <description>HRTIM_EEFxR2 register update               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxEEFR1</name>
                     <description>HRTIM_EEFxR1 register update               enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRST2R</name>
                     <description>HRTIM_RST2xR register update               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxSET2R</name>
                     <description>HRTIM_SET2xR register update               enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRST1R</name>
                     <description>HRTIM_RST1xR register update               enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxSET1R</name>
                     <description>HRTIM_SET1xR register update               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMx_DTxR</name>
                     <description>HRTIM_DTxR register update               enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP4</name>
                     <description>HRTIM_CMP4xR register update               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP3</name>
                     <description>HRTIM_CMP3xR register update               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP2</name>
                     <description>HRTIM_CMP2xR register update               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP1</name>
                     <description>HRTIM_CMP1xR register update               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxREP</name>
                     <description>HRTIM_REPxR register update               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxPER</name>
                     <description>HRTIM_PERxR register update               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCNT</name>
                     <description>HRTIM_CNTxR register update               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxDIER</name>
                     <description>HRTIM_TIMxDIER register update               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxICR</name>
                     <description>HRTIM_TIMxICR register update               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCR</name>
                     <description>HRTIM_TIMxCR register update               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTCUPR</name>
               <displayName>BDTCUPR</displayName>
               <description>Burst DMA Timerx update           Register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMxEEFR3</name>
                     <description>TIMxEEFR3</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCR2</name>
                     <description>TIMxCR2</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxFLTR</name>
                     <description>HRTIM_FLTxR register update               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxOUTR</name>
                     <description>HRTIM_OUTxR register update               enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCHPR</name>
                     <description>HRTIM_CHPxR register update               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRSTR</name>
                     <description>HRTIM_RSTxR register update               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxEEFR2</name>
                     <description>HRTIM_EEFxR2 register update               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxEEFR1</name>
                     <description>HRTIM_EEFxR1 register update               enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRST2R</name>
                     <description>HRTIM_RST2xR register update               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxSET2R</name>
                     <description>HRTIM_SET2xR register update               enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxRST1R</name>
                     <description>HRTIM_RST1xR register update               enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxSET1R</name>
                     <description>HRTIM_SET1xR register update               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMx_DTxR</name>
                     <description>HRTIM_DTxR register update               enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP4</name>
                     <description>HRTIM_CMP4xR register update               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP3</name>
                     <description>HRTIM_CMP3xR register update               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP2</name>
                     <description>HRTIM_CMP2xR register update               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCMP1</name>
                     <description>HRTIM_CMP1xR register update               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxREP</name>
                     <description>HRTIM_REPxR register update               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxPER</name>
                     <description>HRTIM_PERxR register update               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCNT</name>
                     <description>HRTIM_CNTxR register update               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxDIER</name>
                     <description>HRTIM_TIMxDIER register update               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxICR</name>
                     <description>HRTIM_TIMxICR register update               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMxCR</name>
                     <description>HRTIM_TIMxCR register update               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
