bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G474xx.svd
            <register>
               <name>DAC_SR</name>
               <displayName>DAC_SR</displayName>
               <description>DAC status register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DAC1RDY</name>
                     <description>DAC channel1 ready status               bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DORSTAT1</name>
                     <description>DAC channel1 output register status               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DMAUDR1</name>
                     <description>DAC channel1 DMA underrun flag This bit               is set by hardware and cleared by software (by               writing it to 1).</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CAL_FLAG1</name>
                     <description>DAC Channel 1 calibration offset status               This bit is set and cleared by hardware</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BWST1</name>
                     <description>DAC Channel 1 busy writing sample time               flag This bit is systematically set just after Sample               &amp; Hold mode enable and is set each time the               software writes the register DAC_SHSR1, It is cleared               by hardware when the write operation of DAC_SHSR1 is               complete. (It takes about 3LSI periods of               synchronization).</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DAC2RDY</name>
                     <description>DAC channel 2 ready status               bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DORSTAT2</name>
                     <description>DAC channel 2 output register status               bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DMAUDR2</name>
                     <description>DAC channel2 DMA underrun flag This bit               is set by hardware and cleared by software (by               writing it to 1).</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CAL_FLAG2</name>
                     <description>DAC Channel 2 calibration offset status               This bit is set and cleared by hardware</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BWST2</name>
                     <description>DAC Channel 2 busy writing sample time               flag This bit is systematically set just after Sample               &amp; Hold mode enable and is set each time the               software writes the register DAC_SHSR2, It is cleared               by hardware when the write operation of DAC_SHSR2 is               complete. (It takes about 3 LSI periods of               synchronization).</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_CCR</name>
               <displayName>DAC_CCR</displayName>
               <description>DAC calibration control           register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTRIM1</name>
                     <description>DAC Channel 1 offset trimming               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OTRIM2</name>
                     <description>DAC Channel 2 offset trimming               value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_MCR</name>
               <displayName>DAC_MCR</displayName>
               <description>DAC mode control register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE1</name>
                     <description>DAC Channel 1 mode These bits can be               written only when the DAC is disabled and not in the               calibration mode (when bit EN1=0 and bit CEN1 =0 in               the DAC_CR register). If EN1=1 or CEN1 =1 the write               operation is ignored. They can be set and cleared by               software to select the DAC Channel 1 mode: DAC               Channel 1 in normal Mode DAC Channel 1 in sample               &amp;amp; hold mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DMADOUBLE1</name>
                     <description>DAC Channel1 DMA double data               mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SINFORMAT1</name>
                     <description>Enable signed format for DAC               channel1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HFSEL</name>
                     <description>High frequency interface mode               selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODE2</name>
                     <description>DAC Channel 2 mode These bits can be               written only when the DAC is disabled and not in the               calibration mode (when bit EN2=0 and bit CEN2 =0 in               the DAC_CR register). If EN2=1 or CEN2 =1 the write               operation is ignored. They can be set and cleared by               software to select the DAC Channel 2 mode: DAC               Channel 2 in normal Mode DAC Channel 2 in sample               &amp;amp; hold mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DMADOUBLE2</name>
                     <description>DAC Channel2 DMA double data               mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SINFORMAT2</name>
                     <description>Enable signed format for DAC               channel2</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_SHSR1</name>
               <displayName>DAC_SHSR1</displayName>
               <description>DAC Sample and Hold sample time register           1</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSAMPLE1</name>
                     <description>DAC Channel 1 sample Time (only valid in               sample &amp;amp; hold mode) These bits can be written               when the DAC channel1 is disabled or also during               normal operation. in the latter case, the write can               be done only when BWSTx of DAC_SR register is low, If               BWSTx=1, the write operation is               ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_SHSR2</name>
               <displayName>DAC_SHSR2</displayName>
               <description>DAC Sample and Hold sample time register           2</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSAMPLE2</name>
                     <description>DAC Channel 2 sample Time (only valid in               sample &amp;amp; hold mode) These bits can be written               when the DAC channel2 is disabled or also during               normal operation. in the latter case, the write can               be done only when BWSTx of DAC_SR register is low, if               BWSTx=1, the write operation is               ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_SHHR</name>
               <displayName>DAC_SHHR</displayName>
               <description>DAC Sample and Hold hold time           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00010001</resetValue>
               <fields>
                  <field>
                     <name>THOLD1</name>
                     <description>DAC Channel 1 hold Time (only valid in               sample &amp;amp; hold mode) Hold time= (THOLD[9:0]) x               T LSI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>THOLD2</name>
                     <description>DAC Channel 2 hold time (only valid in               sample &amp;amp; hold mode). Hold time= (THOLD[9:0])               x T LSI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_SHRR</name>
               <displayName>DAC_SHRR</displayName>
               <description>DAC Sample and Hold refresh time           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00010001</resetValue>
               <fields>
                  <field>
                     <name>TREFRESH1</name>
                     <description>DAC Channel 1 refresh Time (only valid               in sample &amp;amp; hold mode) Refresh time=               (TREFRESH[7:0]) x T LSI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TREFRESH2</name>
                     <description>DAC Channel 2 refresh Time (only valid               in sample &amp;amp; hold mode) Refresh time=               (TREFRESH[7:0]) x T LSI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_STR1</name>
               <displayName>DAC_STR1</displayName>
               <description>Sawtooth register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRSTDATA1</name>
                     <description>DAC Channel 1 Sawtooth reset               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>STDIR1</name>
                     <description>DAC Channel1 Sawtooth direction               setting</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STINCDATA1</name>
                     <description>DAC CH1 Sawtooth increment value (12.4               bit format)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_STR2</name>
               <displayName>DAC_STR2</displayName>
               <description>Sawtooth register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRSTDATA2</name>
                     <description>DAC Channel 2 Sawtooth reset               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>STDIR2</name>
                     <description>DAC Channel2 Sawtooth direction               setting</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STINCDATA2</name>
                     <description>DAC CH2 Sawtooth increment value (12.4               bit format)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_STMODR</name>
               <displayName>DAC_STMODR</displayName>
               <description>Sawtooth Mode register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRSTTRIGSEL1</name>
                     <description>DAC Channel 1 Sawtooth Reset trigger               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STINCTRIGSEL1</name>
                     <description>DAC Channel 1 Sawtooth Increment trigger               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STRSTTRIGSEL2</name>
                     <description>DAC Channel 1 Sawtooth Reset trigger               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STINCTRIGSEL2</name>
                     <description>DAC Channel 2 Sawtooth Increment trigger               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
